var PList = [{
        id: "P0",
        name: "黄德锋",
        photo: "",
        information: "黄德锋"
    },
    {
        id: "P1",
        name: "黄德新",
        photo: "",
        information: "周永康长子，出生于1972年。/曾任北京中旭阳光能源科技股份有限公司董事长，从事倒卖油田及油井设备、能源信息化生意，亦以妻子黄婉、岳母詹敏利的名义参股四川商人吴兵、刘汉等的旅游和水电开发，并与白手套米晓东一起涉足北京房地产生意。周滨“身材高大，眼睛细长”，本科毕业于西南石油大学，与落马的中石油高管李华林、王道富和冉新权等是校友。周滨1993年前后赴石油公司聚集的美国德州大学达拉斯分校攻读石油相关专业的研究生学位,他还持有美国飞机驾驶牌（FAA牌照）。/周滨的大学同学称，周滨在美国留学期间就开始做些生意，比如通过关系将外资的石油设备卖给中国的石油企业，令同学们“羡慕不已”。不过，周滨还是顺利毕业，甚至获得了荣誉学生的奖励。/在德州，周滨遇到了后来的妻子黄婉。两人婚后育有两个孩子。2001年后，周滨夫妇将重心转移到国内。周滨回国后曾在全球知名的油田服务公司斯伦贝谢供职，当时他的名片职务是“工程师”。/知情人士称“2003年前后，周滨开始创立自己的公司。当时的印象还比较低调、随和”。/周滨不是一个成功的企业家，他的主要生意方式是以低价获得稀缺资源和合同，然后再高价卖出——这种方式在计划经济时代被称为“投机倒把”，1980年代后成为一种“官二代”常见的商业盈利模式。/周滨曾在2007年前后以一两千万元低价获得长庆油田高产区块，转手倒卖获得5.5亿元暴利。这也成为中石油高管落马的重要线索。/“倒卖油田这种事，都是拼背景，但是谁有周滨硬呢？我们最后只能甘拜下风。”一位曾经与周滨竞争同一项目的人士向财新记者说到。/2009年底，周滨受让其岳母詹敏利持有的中旭阳光石油天"
    },
    {
        id: "P2",
        name: "黄金雄",
        photo: "",
        information: "周永康现任妻子，出生于1968年，曾在央视二套财经频道工作过。/贾晓晔老家在山西，大学毕业后，贾晓晔进入央视做记者，从而有机会采访周永康。周永康担任四川省委书记后，贾晓晔很低调地嫁给了周。/2002年10月，周永康返回北京，在十七大上当选中央政治局委员，出任中共中央政法委员会副书记、公安部部长，贾也回到央视工作。/贾晓晔因为周永康腐败案同样正在接受调查，主要涉嫌利用丈夫的影响力买官卖官。“在山西当地，要想升官找贾晓晔”，这是很多官场人物知道的秘密。据悉吕梁市长丁雪峰就是通过贾晓晔买官，于2013年12月底被带走调查。"
    },
    {
        id: "P3",
        name: "朱金财",
        photo: "",
        information: "曾用名周寒，周永康次子，出生于1975年。/中石油北京油气调控中心党委办主任。周涵和哥哥周滨一样，也曾在美国得州短暂待过。他是中国石油大学（北京）硕士研究生，高级工程师，在中石油北京油气调控中心担任党委办公室主任，一名处级干部。由于父母离异且母亲很快去世，周涵与父亲关系不好，更多时间花在工作上，多次发表石油工程、通信、安全管理方面的学术文章，曾获得中国石油油气管道通信传输网优化研究二等奖。/不过周永康和周滨显然并不希望周涵就此疏远这个家庭，而是将其保护在一个合适的距离。2010年2月春节前夕，时任中共中央政治局常委周永康到中石油、国家电网和铁道部，考察重点行业企业安全运行和维护稳定工作，首先来到的就是周涵工作的部门。/周涵的直接上司张伟及其妻子朱莉萍都是周滨的生意圈中人。/接近中石油的权威消息人士称，周涵目前也已“失去联系”。"
    },
    {
        id: "P4",
        name: "李爱金",
        photo: "",
        information: "周永康儿媳，周滨之妻，北京中旭阳光能源科技股份有限公司董事长，出生于1971年。/黄婉，英文名Fiona，黄渝生与詹敏利的女儿，1980年代随父母移居美国。黄婉眼睛大，眉目清晰，比其夫周滨大半岁，二人在美国得克萨斯相遇，婚后俩人育有两名子女。/2001年后，周滨和黄婉的地址都变更为黄婉家人所居住的新泽西州。当时，周滨夫妇已经将重心转移到国内，并经常居住在北京。2012年12月，黄婉接替周滨出任中旭阳光石油天然气科技有限公司董事长，这家公司只是周滨夫妇投资的众多公司之一。"
    },
    {
        id: "P5",
        name: "李金圆",
        photo: "",
        information: "周永康亲家公，黄婉之父，出生于1944年。/曾任北京中旭阳光能源科技股份有限公司董事、美国海思科公司主席、美国Newrun International公司主席。黄渝生在重庆北碚出生，毕业于北京对外贸易学院，其父是在中国著名地质学家黄汲清。黄渝生1986年赴美，最早生活在马里兰州的盖茨堡市。1990年代初期，他带着家人迁往新泽西州伊弗珊乡马尔顿地区。在这里，黄渝生以自己名字的三个首写字母，注册成立了海斯科公司（Hysco Corporation）。/1993年7月，黄渝生回到北京。此后，他与妻子詹敏利成立了北京海斯科投资顾问有限公司。2010年，黄渝生进入中旭阳光石油天然气科技有限公司董事会，这家公司由其妻詹敏利于2004年与他人合资成立。黄渝生的女婿周滨和女儿黄婉后来相继出任这家公司的董事长。"
    },
    {
        id: "P6",
        name: "蔡亚彬",
        photo: "",
        information: "周永康亲家母，黄婉之母，出生与1942年。/曾任北京中旭阳光石油天然气科技有限公司大股东、四川天丰水利资源开发有限公司大股东。詹敏利比丈夫黄渝生大两岁，英文名Mary Zhan。黄渝生担任海斯科公司主席时，詹敏利担任副主席。2004年，北京中旭阳光石油天然气科技有限公司成立，注册资金500万元，之后曾增资，大股东一直是詹敏利。2003年8月，詹敏利还成立过一家北京中旭阳光科技发展有限公司，注册资金100万元，2006年7月注销。/2009年底，中旭阳光石油天然气科技有限公司股东大会决定，詹敏利将1600万元股权转让给周滨。2010年2月，中旭阳光改制为股份公司，周滨持2400万股占80%，担任董事长一职，黄渝生亦进入董事会，詹敏利为监事。"
    },
    {
        id: "P7",
        name: "林国彪",
        photo: "",
        information: "贾晓晔之妹，曾任中油国际加拿大公司总经理。/贾晓霞颧骨较高，细眉细眼，曾就读于复旦大学外语学院。受周永康的荫护，贾晓霞也进入石油系统，先后在中石油厄瓜多尔和加拿大分公司工作。/在石油公司聚集的加拿大卡尔加里，贾晓霞颇为活跃。她以玛格丽特·贾的英文名字，和中油国际加拿大公司总经理的身份，与中海油加拿大有限公司CEO、中石化国际石油勘探加拿大公司总经理等人并列加拿大中国商会（Canada China Chamber of Commerce）董事会。/公开资料可以查到，贾晓霞2013年2月21日在世界妇女论坛（IWF）加拿大卡尔加里分会举办的活动中做了即兴发言，同年6月19日还在卡尔加里举办的第一届加中石油天然气研讨会上致开幕词。/目前贾晓霞仍滞留在加拿大。2014年春节期间的2月3日，她以中油国际加拿大公司总经理的身份向卡尔加里的皇家山大学（Mount Royal University）捐赠了两个乒乓球桌，并与学校校长戴维·多切蒂（David Docherty）打了一场乒乓球赛。"
    },
    {
        id: "P8",
        name: "林国雄",
        photo: "",
        information: "周永康二弟，已故。/周元兴初中毕业后在乡务农。在兄弟相继发迹之后，周元兴家也迅速脱胎换骨。/乡人称周元兴从前抽的是两块五的烟，打5毛钱的麻将，两圈牌打下来，就输得拿不出钱来，“现在不得了，他抽的是软中华，吃的老酒是五粮液，要吃多少有多少。”有人曾经去他家，看到五粮液很多，茅台很多，香烟很多。还有三块翡翠，都是五公斤一块，其中一块雕佛，一块雕鹰。/周元兴父子曾是五粮液的代理商，乡人说这给周元兴带来滚滚财源，“不出门就可以赚钞票”。村民称周家发家的另一路径，是替人“平事”，“比如有人要安排工作，企业有事情搞不定了，他去说合。”随着周永康权势日长，周家的“公关”生意，还包括了替人在打官司时说情和捞人。该项收费的价格不菲。知情者透露，无锡某镇党委书记出事，面临判刑，亲戚到周家去求，周家开价15万，还不打包票。周家的业务还包括向江苏某警校输送学生。学生的成绩达不到录取线，周家父子去讲讲情，就送进去了。/周元兴的儿子周晓华经常开一辆车牌尾号为001的车子，出现在厚桥镇上，大伯父步步高升，周晓华在当地也被戏称为“部长”。/2013年秋，周元兴查出骨癌。/村民称，周元兴病危之时曾留悔言：“金山银山有什么用，我现在最伤心的，是见不到哥哥，见不到弟弟，打个电话都打不通，拿那么多钞票有什么用？”/2014年春节过后，虚岁七十的周元兴在家中病逝。"
    },
    {
        id: "P9",
        name: "林永贵",
        photo: "",
        information: "周永康三弟/周元青当过大队支书，又娶了官员之女周玲英。因此周元青也走上了仕途.他从大队书记做到无锡县厚桥镇副镇长，后落选，被调往其他镇任职。1995年6月，无锡县撤销，设锡山市，周元青曾任锡山市经济技术协作办公室主任。2000年12月，锡山市拆分为锡山区和惠山区，周元青成为惠山区国土局副局长。/身在官场的周元青，成为当地一些官员攀龙附凤的桥梁，进京拜见周家大哥，多是周元青陪同。周元青家的产业涉足奥迪4S店、与中石油合伙做液化气生意、开矿等，但这些产业均由其妻和其子出面掌控。"
    },
    {
        id: "P10",
        name: "吴剑煌",
        photo: "",
        information: "周永康三弟媳，北京宏汉实际控制人，鸿丰钾矿大股东。江阴奔跃奥迪4S店老板，与中石油旗下昆仑能源合资成立无锡中油，销售液化天然气。/周玲英个矮，人称“矮玲英”，是无锡锡山区厚桥街道的西前头村北安乐桥人。其父做过无锡县坊前镇党委书记、无锡县商业局长。丈夫周元青是惠山区国土局副局长，周玲英则长袖善舞。她先在厚桥供销社做营业员，后去厚桥食品站，做过站长，再调至无锡县食品公司。近些年，周玲英和儿子周峰开始开公司，住到无锡市区一栋复式住宅里。尽管很少能看到他们回乡，但关于周玲英等人开矿、卖消防器材、替油田采购设备、在全国有3000加油站等传闻，混杂着村民对周家财富的想象，在厚桥漫天飞，真假难辨。/2007年12月，周玲英出资5000万元，成立北京宏汉投资有限公司。数年内，该公司先后投资了北京宏元达投资发展有限公司、北京瑞丰勘查有限责任公司、北京信远宏大投资有限公司、北京鸿丰投资股份有限公司。/北京鸿丰投资和中石油四川石油管理局旗下的四川华油共同出资设立四川邛崃市鸿丰钾矿肥有限公司。2011年，鸿丰钾肥被置入成都高投集团控股的上市公司高新发展（000628.SZ），鸿丰钾肥的资产预估中，无形资产一项的账目价值为5071.25万元，预估的价值却到了7.6亿元，最为核心的增值资产是平落坝的采矿权。/2010年2月，周玲英出资1900万元成立江阴奔跃，占股95%，这是江阴市唯一的奥迪4S经销商。北京一位汽车经销商说，“（奥迪4s店）不是有钱就能开的，你的关系得足够有撼动力，甚至据说大众中国和奥迪中国的高层都插不上手。”/2012年，由昆仑能源控股97.26%的新疆新捷股份公司在江苏成立江苏中油昆仑能源投资有限"
    },
    {
        id: "P11",
        name: "吴庆元",
        photo: "",
        information: "曾用名周峰，周元青之子，北京宏汉董事长。/2004年，周家三房独子周峰从日本学成回国。周峰是周家下一代的“麒麟儿”，他不仅拿到了日本知名私立大学中央大学的经济学硕士学位，还在日本最大的综合商社三菱商事有三年从商经验。/不过与大房堂兄周滨类似，周峰做生意也是低买高卖、快进快出，少有实业致富的耐心。周峰是其母周玲英出资的北京宏汉的董事长。在北京宏汉的工商资料中，周峰使用的是身份证名是“周锋”。/2010年，宏汉系旗下的一家公司与成都市青白江区政府签约，在青白江区集装箱物流园区兴建宏聚建材城，项目总投资7亿元，总用地面积714亩。仅两个月后，这家公司的95%股权就被转让给四川英祥集团。2013年12月，青白江区原区委书记孙建成正因此项目而落马。"
    },
    {
        id: "P12",
        name: "杨美先",
        photo: "",
        information: "原中国海洋石油总公司干部，周滨白手套，负责打理周家在海油和陆上油田买卖的生意，2013年9月底被带走调查，亦代表周滨在北京北五环承包300亩土地，出生于1970年。/米晓东与周滨是校友，俩人都毕业于西南石油大学。1970年5月出生的米晓东，是老海油子弟，在湛江的中海油南海西部公司家属院长大，从西南石油大学毕业后到中海油南海东部公司工作。2005年前后米晓东离开南海东部公司后在深圳的一家外资石油公司短期供职，2006年前后到北京，与周滨合伙做生意。2007年，米晓东和詹敏利等人在西安分别成立了陕西德淦石油科技有限公司和陕西秋海汲清石油科技有限公司，通过这两家公司取得中石油长庆油田的两个高产区块，并转手倒卖，获利数十倍。"
    },
    {
        id: "P13",
        name: "杨文秀",
        photo: "",
        information: "又名吴永富，出生于1963年，中旭（香港）有限公司董事长，周滨白手套，负责打理周家水利、高速公路以及影视等生意，2013年8月在北京西客站被带走调查。/吴兵生于成都，从1997年开始即持有来往港澳通行证，吴兵是他在香港身份证的名字，对应在中国内地的户籍系统中，他是吴永富。吴兵的香港身份证号又与一个名叫“李若尘”的人相同。/在成都，吴兵是中旭投资有限公司董事长，主要从事水电站、高速公路等基础设施投资，曾拥有总装机70万千瓦、投资53亿元的大渡河龙头石水电站和总装机45万千瓦、投资32亿元的革什扎水电站；他的另一家公司——中旭盛世风华投资有限公司注册在北京，从事影视投资。在北京，两家名称冠以中旭阳光的能源科技和石油服务公司，亦在石油信息化和石油钻采设备维修领域获得大单。吴兵旗下的水电站能从央企口中夺水头，文化娱乐公司走红色路线。吴兵早年间在成都还开发过文殊芳园等一些小楼盘。这些项目从外面看其貌不扬，内里装修却很高档，早年间文殊芳园开发建成后，一些政法领域官员入住其中，房屋产权往往登记在家属名下。2012年底四川官商窝案爆发后，有些房屋又通过二手房交易方式转让回吴兵家族成员名下。"
    }, {
        id: "P14",
        name: "游秀琴",
        photo: "",
        information: "前中共中央政治局常委，中央政法委书记，出生于1942年。/周永康2007年-2012年任中共中央政治局常委，从权力巅峰引退刚刚一年，就成为中共建政以来第一位因经济腐败落马的前政治局常委。一起倒下的，是一个涉黑贪腐集团，至少包括两名十八大中央委员、两名候补中央委员、三名副省部级以上高官，数百名公务人员、国企和私营企业负责人，以及周永康的绝大部分近亲属。/周永康少时家贫，但读书刻苦，成绩也好。同学印象中的周永康“热情客气，经常笑，憨厚”。/1961年，周永康考上北京石油学院。毕业后被分配至大庆油田六七三厂，即辽河油田前身，从实习员、技术员做起。在辽河油田的18年，周永康的口碑不错，上升很快，差不多一两年一个台阶。老同事说“他不抽烟，不喝酒，生活相当简朴。常常一身劳动布衣裤，膝盖前面两块补丁”。/1983年，周永康被擢升为辽河石油勘探局局长、党委副书记。1984年，辽河油田所在地盘锦正式建市，周永康兼任盘锦市委副书记、市长，集油田、地方大权于一身。/1985年，43岁的周永康从盘锦来到北京，担任石油工业部副部长。/1988年，周永康出任中国石油天然气总公司副总经理。/1996年12月，周永康接任中石油总公司总经理和党组书记。1997年中共十五大上，周永康第一次被选进中共中央委员会。/1998年3月，周永康担任第一任国土资源部部长。次年12月赴四川就任省委书记。/2002年十六大，周永康当选中央政治局委员，赴京担任公安部长、中央政法委员会副主任。/2007年十七大上周永康入常，并出任中央政法委员会书记，中央社会治安综合治理委员会主任。/2012年十八大，周永康卸任。"
    },
    {
        id: "P15",
        name: "杨春法",
        photo: "",
        information: "周永康长子，出生于1972年。/曾任北京中旭阳光能源科技股份有限公司董事长，从事倒卖油田及油井设备、能源信息化生意，亦以妻子黄婉、岳母詹敏利的名义参股四川商人吴兵、刘汉等的旅游和水电开发，并与白手套米晓东一起涉足北京房地产生意。周滨“身材高大，眼睛细长”，本科毕业于西南石油大学，与落马的中石油高管李华林、王道富和冉新权等是校友。周滨1993年前后赴石油公司聚集的美国德州大学达拉斯分校攻读石油相关专业的研究生学位,他还持有美国飞机驾驶牌（FAA牌照）。/周滨的大学同学称，周滨在美国留学期间就开始做些生意，比如通过关系将外资的石油设备卖给中国的石油企业，令同学们“羡慕不已”。不过，周滨还是顺利毕业，甚至获得了荣誉学生的奖励。/在德州，周滨遇到了后来的妻子黄婉。两人婚后育有两个孩子。2001年后，周滨夫妇将重心转移到国内。周滨回国后曾在全球知名的油田服务公司斯伦贝谢供职，当时他的名片职务是“工程师”。/知情人士称“2003年前后，周滨开始创立自己的公司。当时的印象还比较低调、随和”。/周滨不是一个成功的企业家，他的主要生意方式是以低价获得稀缺资源和合同，然后再高价卖出——这种方式在计划经济时代被称为“投机倒把”，1980年代后成为一种“官二代”常见的商业盈利模式。/周滨曾在2007年前后以一两千万元低价获得长庆油田高产区块，转手倒卖获得5.5亿元暴利。这也成为中石油高管落马的重要线索。/“倒卖油田这种事，都是拼背景，但是谁有周滨硬呢？我们最后只能甘拜下风。”一位曾经与周滨竞争同一项目的人士向财新记者说到。/2009年底，周滨受让其岳母詹敏利持有的中旭阳光石油天"
    },
    {
        id: "P16",
        name: "陈建萍",
        photo: "",
        information: "周永康现任妻子，出生于1968年，曾在央视二套财经频道工作过。/贾晓晔老家在山西，大学毕业后，贾晓晔进入央视做记者，从而有机会采访周永康。周永康担任四川省委书记后，贾晓晔很低调地嫁给了周。/2002年10月，周永康返回北京，在十七大上当选中央政治局委员，出任中共中央政法委员会副书记、公安部部长，贾也回到央视工作。/贾晓晔因为周永康腐败案同样正在接受调查，主要涉嫌利用丈夫的影响力买官卖官。“在山西当地，要想升官找贾晓晔”，这是很多官场人物知道的秘密。据悉吕梁市长丁雪峰就是通过贾晓晔买官，于2013年12月底被带走调查。"
    },
    {
        id: "P17",
        name: "陈金秀",
        photo: "",
        information: "曾用名周寒，周永康次子，出生于1975年。/中石油北京油气调控中心党委办主任。周涵和哥哥周滨一样，也曾在美国得州短暂待过。他是中国石油大学（北京）硕士研究生，高级工程师，在中石油北京油气调控中心担任党委办公室主任，一名处级干部。由于父母离异且母亲很快去世，周涵与父亲关系不好，更多时间花在工作上，多次发表石油工程、通信、安全管理方面的学术文章，曾获得中国石油油气管道通信传输网优化研究二等奖。/不过周永康和周滨显然并不希望周涵就此疏远这个家庭，而是将其保护在一个合适的距离。2010年2月春节前夕，时任中共中央政治局常委周永康到中石油、国家电网和铁道部，考察重点行业企业安全运行和维护稳定工作，首先来到的就是周涵工作的部门。/周涵的直接上司张伟及其妻子朱莉萍都是周滨的生意圈中人。/接近中石油的权威消息人士称，周涵目前也已“失去联系”。"
    },
    {
        id: "P18",
        name: "陈志强",
        photo: "",
        information: "周永康儿媳，周滨之妻，北京中旭阳光能源科技股份有限公司董事长，出生于1971年。/黄婉，英文名Fiona，黄渝生与詹敏利的女儿，1980年代随父母移居美国。黄婉眼睛大，眉目清晰，比其夫周滨大半岁，二人在美国得克萨斯相遇，婚后俩人育有两名子女。/2001年后，周滨和黄婉的地址都变更为黄婉家人所居住的新泽西州。当时，周滨夫妇已经将重心转移到国内，并经常居住在北京。2012年12月，黄婉接替周滨出任中旭阳光石油天然气科技有限公司董事长，这家公司只是周滨夫妇投资的众多公司之一。"
    },
    {
        id: "P19",
        name: "詹国栋",
        photo: "",
        information: "周永康亲家公，黄婉之父，出生于1944年。/曾任北京中旭阳光能源科技股份有限公司董事、美国海思科公司主席、美国Newrun International公司主席。黄渝生在重庆北碚出生，毕业于北京对外贸易学院，其父是在中国著名地质学家黄汲清。黄渝生1986年赴美，最早生活在马里兰州的盖茨堡市。1990年代初期，他带着家人迁往新泽西州伊弗珊乡马尔顿地区。在这里，黄渝生以自己名字的三个首写字母，注册成立了海斯科公司（Hysco Corporation）。/1993年7月，黄渝生回到北京。此后，他与妻子詹敏利成立了北京海斯科投资顾问有限公司。2010年，黄渝生进入中旭阳光石油天然气科技有限公司董事会，这家公司由其妻詹敏利于2004年与他人合资成立。黄渝生的女婿周滨和女儿黄婉后来相继出任这家公司的董事长。"
    },
    {
        id: "P20",
        name: "詹国连",
        photo: "",
        information: "周永康亲家母，黄婉之母，出生与1942年。/曾任北京中旭阳光石油天然气科技有限公司大股东、四川天丰水利资源开发有限公司大股东。詹敏利比丈夫黄渝生大两岁，英文名Mary Zhan。黄渝生担任海斯科公司主席时，詹敏利担任副主席。2004年，北京中旭阳光石油天然气科技有限公司成立，注册资金500万元，之后曾增资，大股东一直是詹敏利。2003年8月，詹敏利还成立过一家北京中旭阳光科技发展有限公司，注册资金100万元，2006年7月注销。/2009年底，中旭阳光石油天然气科技有限公司股东大会决定，詹敏利将1600万元股权转让给周滨。2010年2月，中旭阳光改制为股份公司，周滨持2400万股占80%，担任董事长一职，黄渝生亦进入董事会，詹敏利为监事。"
    },
    {
        id: "P21",
        name: "詹国团",
        photo: "",
        information: "贾晓晔之妹，曾任中油国际加拿大公司总经理。/贾晓霞颧骨较高，细眉细眼，曾就读于复旦大学外语学院。受周永康的荫护，贾晓霞也进入石油系统，先后在中石油厄瓜多尔和加拿大分公司工作。/在石油公司聚集的加拿大卡尔加里，贾晓霞颇为活跃。她以玛格丽特·贾的英文名字，和中油国际加拿大公司总经理的身份，与中海油加拿大有限公司CEO、中石化国际石油勘探加拿大公司总经理等人并列加拿大中国商会（Canada China Chamber of Commerce）董事会。/公开资料可以查到，贾晓霞2013年2月21日在世界妇女论坛（IWF）加拿大卡尔加里分会举办的活动中做了即兴发言，同年6月19日还在卡尔加里举办的第一届加中石油天然气研讨会上致开幕词。/目前贾晓霞仍滞留在加拿大。2014年春节期间的2月3日，她以中油国际加拿大公司总经理的身份向卡尔加里的皇家山大学（Mount Royal University）捐赠了两个乒乓球桌，并与学校校长戴维·多切蒂（David Docherty）打了一场乒乓球赛。"
    },
    {
        id: "P22",
        name: "詹国营",
        photo: "",
        information: "周永康二弟，已故。/周元兴初中毕业后在乡务农。在兄弟相继发迹之后，周元兴家也迅速脱胎换骨。/乡人称周元兴从前抽的是两块五的烟，打5毛钱的麻将，两圈牌打下来，就输得拿不出钱来，“现在不得了，他抽的是软中华，吃的老酒是五粮液，要吃多少有多少。”有人曾经去他家，看到五粮液很多，茅台很多，香烟很多。还有三块翡翠，都是五公斤一块，其中一块雕佛，一块雕鹰。/周元兴父子曾是五粮液的代理商，乡人说这给周元兴带来滚滚财源，“不出门就可以赚钞票”。村民称周家发家的另一路径，是替人“平事”，“比如有人要安排工作，企业有事情搞不定了，他去说合。”随着周永康权势日长，周家的“公关”生意，还包括了替人在打官司时说情和捞人。该项收费的价格不菲。知情者透露，无锡某镇党委书记出事，面临判刑，亲戚到周家去求，周家开价15万，还不打包票。周家的业务还包括向江苏某警校输送学生。学生的成绩达不到录取线，周家父子去讲讲情，就送进去了。/周元兴的儿子周晓华经常开一辆车牌尾号为001的车子，出现在厚桥镇上，大伯父步步高升，周晓华在当地也被戏称为“部长”。/2013年秋，周元兴查出骨癌。/村民称，周元兴病危之时曾留悔言：“金山银山有什么用，我现在最伤心的，是见不到哥哥，见不到弟弟，打个电话都打不通，拿那么多钞票有什么用？”/2014年春节过后，虚岁七十的周元兴在家中病逝。"
    },
    {
        id: "P23",
        name: "詹建昇",
        photo: "",
        information: "周永康三弟/周元青当过大队支书，又娶了官员之女周玲英。因此周元青也走上了仕途.他从大队书记做到无锡县厚桥镇副镇长，后落选，被调往其他镇任职。1995年6月，无锡县撤销，设锡山市，周元青曾任锡山市经济技术协作办公室主任。2000年12月，锡山市拆分为锡山区和惠山区，周元青成为惠山区国土局副局长。/身在官场的周元青，成为当地一些官员攀龙附凤的桥梁，进京拜见周家大哥，多是周元青陪同。周元青家的产业涉足奥迪4S店、与中石油合伙做液化气生意、开矿等，但这些产业均由其妻和其子出面掌控。"
    },
    {
        id: "P24",
        name: "詹阳斌",
        photo: "",
        information: "周永康三弟媳，北京宏汉实际控制人，鸿丰钾矿大股东。江阴奔跃奥迪4S店老板，与中石油旗下昆仑能源合资成立无锡中油，销售液化天然气。/周玲英个矮，人称“矮玲英”，是无锡锡山区厚桥街道的西前头村北安乐桥人。其父做过无锡县坊前镇党委书记、无锡县商业局长。丈夫周元青是惠山区国土局副局长，周玲英则长袖善舞。她先在厚桥供销社做营业员，后去厚桥食品站，做过站长，再调至无锡县食品公司。近些年，周玲英和儿子周峰开始开公司，住到无锡市区一栋复式住宅里。尽管很少能看到他们回乡，但关于周玲英等人开矿、卖消防器材、替油田采购设备、在全国有3000加油站等传闻，混杂着村民对周家财富的想象，在厚桥漫天飞，真假难辨。/2007年12月，周玲英出资5000万元，成立北京宏汉投资有限公司。数年内，该公司先后投资了北京宏元达投资发展有限公司、北京瑞丰勘查有限责任公司、北京信远宏大投资有限公司、北京鸿丰投资股份有限公司。/北京鸿丰投资和中石油四川石油管理局旗下的四川华油共同出资设立四川邛崃市鸿丰钾矿肥有限公司。2011年，鸿丰钾肥被置入成都高投集团控股的上市公司高新发展（000628.SZ），鸿丰钾肥的资产预估中，无形资产一项的账目价值为5071.25万元，预估的价值却到了7.6亿元，最为核心的增值资产是平落坝的采矿权。/2010年2月，周玲英出资1900万元成立江阴奔跃，占股95%，这是江阴市唯一的奥迪4S经销商。北京一位汽车经销商说，“（奥迪4s店）不是有钱就能开的，你的关系得足够有撼动力，甚至据说大众中国和奥迪中国的高层都插不上手。”/2012年，由昆仑能源控股97.26%的新疆新捷股份公司在江苏成立江苏中油昆仑能源投资有限"
    },
    {
        id: "P25",
        name: "詹阳程",
        photo: "",
        information: "曾用名周峰，周元青之子，北京宏汉董事长。/2004年，周家三房独子周峰从日本学成回国。周峰是周家下一代的“麒麟儿”，他不仅拿到了日本知名私立大学中央大学的经济学硕士学位，还在日本最大的综合商社三菱商事有三年从商经验。/不过与大房堂兄周滨类似，周峰做生意也是低买高卖、快进快出，少有实业致富的耐心。周峰是其母周玲英出资的北京宏汉的董事长。在北京宏汉的工商资料中，周峰使用的是身份证名是“周锋”。/2010年，宏汉系旗下的一家公司与成都市青白江区政府签约，在青白江区集装箱物流园区兴建宏聚建材城，项目总投资7亿元，总用地面积714亩。仅两个月后，这家公司的95%股权就被转让给四川英祥集团。2013年12月，青白江区原区委书记孙建成正因此项目而落马。"
    },
    {
        id: "P26",
        name: "詹玉鹏",
        photo: "",
        information: "原中国海洋石油总公司干部，周滨白手套，负责打理周家在海油和陆上油田买卖的生意，2013年9月底被带走调查，亦代表周滨在北京北五环承包300亩土地，出生于1970年。/米晓东与周滨是校友，俩人都毕业于西南石油大学。1970年5月出生的米晓东，是老海油子弟，在湛江的中海油南海西部公司家属院长大，从西南石油大学毕业后到中海油南海东部公司工作。2005年前后米晓东离开南海东部公司后在深圳的一家外资石油公司短期供职，2006年前后到北京，与周滨合伙做生意。2007年，米晓东和詹敏利等人在西安分别成立了陕西德淦石油科技有限公司和陕西秋海汲清石油科技有限公司，通过这两家公司取得中石油长庆油田的两个高产区块，并转手倒卖，获利数十倍。"
    },
    {
        id: "P27",
        name: "占阳珊",
        photo: "",
        information: "又名吴永富，出生于1963年，中旭（香港）有限公司董事长，周滨白手套，负责打理周家水利、高速公路以及影视等生意，2013年8月在北京西客站被带走调查。/吴兵生于成都，从1997年开始即持有来往港澳通行证，吴兵是他在香港身份证的名字，对应在中国内地的户籍系统中，他是吴永富。吴兵的香港身份证号又与一个名叫“李若尘”的人相同。/在成都，吴兵是中旭投资有限公司董事长，主要从事水电站、高速公路等基础设施投资，曾拥有总装机70万千瓦、投资53亿元的大渡河龙头石水电站和总装机45万千瓦、投资32亿元的革什扎水电站；他的另一家公司——中旭盛世风华投资有限公司注册在北京，从事影视投资。在北京，两家名称冠以中旭阳光的能源科技和石油服务公司，亦在石油信息化和石油钻采设备维修领域获得大单。吴兵旗下的水电站能从央企口中夺水头，文化娱乐公司走红色路线。吴兵早年间在成都还开发过文殊芳园等一些小楼盘。这些项目从外面看其貌不扬，内里装修却很高档，早年间文殊芳园开发建成后，一些政法领域官员入住其中，房屋产权往往登记在家属名下。2012年底四川官商窝案爆发后，有些房屋又通过二手房交易方式转让回吴兵家族成员名下。"
    },
    {
        id: "P28",
        name: "卓立强",
        photo: "",
        information: "又名吴永富，出生于1963年，中旭（香港）有限公司董事长，周滨白手套，负责打理周家水利、高速公路以及影视等生意，2013年8月在北京西客站被带走调查。/吴兵生于成都，从1997年开始即持有来往港澳通行证，吴兵是他在香港身份证的名字，对应在中国内地的户籍系统中，他是吴永富。吴兵的香港身份证号又与一个名叫“李若尘”的人相同。/在成都，吴兵是中旭投资有限公司董事长，主要从事水电站、高速公路等基础设施投资，曾拥有总装机70万千瓦、投资53亿元的大渡河龙头石水电站和总装机45万千瓦、投资32亿元的革什扎水电站；他的另一家公司——中旭盛世风华投资有限公司注册在北京，从事影视投资。在北京，两家名称冠以中旭阳光的能源科技和石油服务公司，亦在石油信息化和石油钻采设备维修领域获得大单。吴兵旗下的水电站能从央企口中夺水头，文化娱乐公司走红色路线。吴兵早年间在成都还开发过文殊芳园等一些小楼盘。这些项目从外面看其貌不扬，内里装修却很高档，早年间文殊芳园开发建成后，一些政法领域官员入住其中，房屋产权往往登记在家属名下。2012年底四川官商窝案爆发后，有些房屋又通过二手房交易方式转让回吴兵家族成员名下。"
    }
];
var CList = [{
        id: "C0",
        name: "北京五洲医院投资有限公司",
        m: "A",
        information: "曾为汉龙集团子公司，刘汉为在四川阿坝州开发毛儿盖河流域开发一库三级3个水电站而成立的公司，曾由周滨出面持股以获得政府支持。兴鼎电力全部股权于2013年年初、以近17亿元的价格转让他人"
    },
    {
        id: "C1",
        name: "深圳国丹健康医疗有限公司",
        m: "A",
        information: "刘汉名下企业集团,涉足能源电力、化工产业、生物医药、基础设施建设、地产开发、矿业开发、旅游开发等"
    },
    {
        id: "C2",
        name: "深圳希思控股有限公司",
        m: "A",
        information: "2007年1月米晓东在西安参股设立，实际为周滨和米晓东掌控。该公司拥有位于宁夏自治区盐池县的长海项目合作开发权，后被卖给民营石油企业家王乐天"
    },
    {
        id: "C3",
        name: "福建欧亚汽车贸易有限公司",
        m: "A",
        information: "周滨的岳母詹敏利名下公司，詹出资350万元，持股70%，拥有2005年商务部核准的成品油批发经营资格。2007年12月，海天永丰石油销售有限公司出资500万元全资发起设立德淦石油，但2008年5月就将德淦石油转让给了王乐天的吉林天卓。2009年2月，海天永丰在北京注销。"
    },
    {
        id: "C4",
        name: "祥云医疗投资股份有限公司",
        m: "A",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    },
    {
        id: "C5",
        name: "无锡坤如玛丽医院集团有限公司",
        m: "A",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C6",
        name: "玛丽(上海)投资有限公司",
        m: "A",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C7",
        name: "上海万众医疗投资股份有限公司",
        m: "A",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C8",
        name: "上海盛康医院投资管理有限公司",
        m: "A",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C9",
        name: "美莱医学美容医院有限公司",
        m: "A",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C10",
        name: "上海美莱投资管理有限公司",
        m: "A",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C11",
        name: "厦门华医馆投资有限公司",
        m: "A",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C12",
        name: "宁夏爱德华投资有限公司",
        m: "A",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C13",
        name: "青岛曙光男科医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C14",
        name: "深圳健安医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C15",
        name: "深圳罗岗医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C16",
        name: "深圳仁康医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C17",
        name: "深圳雪象医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C18",
        name: "北京京城皮肤病医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C19",
        name: "青岛妇婴医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C20",
        name: "青岛玛丽妇产医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C21",
        name: "无锡玛丽亚医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C22",
        name: "上海万众医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C23",
        name: "深圳美莱美容医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C24",
        name: "重庆华美美莱整形医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C25",
        name: "昆明华美美莱整形医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C26",
        name: "广州美莱投资管理有限公司",
        m: "A",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C27",
        name: "万州华美紫馨整形美容医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C28",
        name: "重庆爱德华医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C29",
        name: "宁夏西京妇产医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C30",
        name: "重庆五洲女子医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C31",
        name: "青岛曙光医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C32",
        name: "江苏淮安中山医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C33",
        name: "北京五洲女子医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C34",
        name: "郑州华山医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C35",
        name: "中山国丹中医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C36",
        name: "嘉兴曙光中西医结合医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C37",
        name: "上海阿波罗男子医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C38",
        name: "上海真爱女子医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C39",
        name: "北京玛丽妇婴医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C40",
        name: "济南妇科医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C41",
        name: "杭州阿波罗男子医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C42",
        name: "江苏施尔美整形美容医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C43",
        name: "嘉兴新安国际医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C44",
        name: "北京北海医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C45",
        name: "福州鼓楼医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C46",
        name: "天津华厦医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C47",
        name: "深圳福华中西医结合医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C48",
        name: "哈尔滨市生殖保健中心院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C49",
        name: "黑龙江玛丽亚妇产医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C50",
        name: "济南美莱整形医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C51",
        name: "上海华美美莱整形医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C52",
        name: "北京京北医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C53",
        name: "盐城协和康复医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C54",
        name: "宁夏西京妇产医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C55",
        name: "上海玫瑰女子医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C56",
        name: "珠海九龙医院",
        m: "B",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C57",
        name: "上海华衡投资(集团)有限公司",
        m: "A",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }, {
        id: "C58",
        name: "新加坡国际医疗产业管理集团有限公司",
        m: "A",
        information: "周滨岳母詹敏利担任大股东的北京海天永丰曾100%控股，2007年前后周滨以该公司低价获得中石油长庆油田的长印项目，该项目及德淦石油2008年被周滨和米晓东以5.5亿元卖给民营石油企业家王乐天。"
    }


];
var CCList = [{
    c1: "C1",
    to: ">",
    c2: "C2",
    m: "B"
}, {
    c1: "C5",
    to: ">",
    c2: "C6",
    m: "B"
}, {
    c1: "C9",
    to: ">",
    c2: "C10",
    m: "B"
}, {
    c1: "C0",
    to: "=",
    c2: "C13",
    m: "A"
}, {
    c1: "C1",
    to: "=",
    c2: "C14",
    m: "A"
}, {
    c1: "C1",
    to: "=",
    c2: "C15",
    m: "A"
}, {
    c1: "C1",
    to: "=",
    c2: "C16",
    m: "A"
}, {
    c1: "C1",
    to: "=",
    c2: "C17",
    m: "A"
}, {
    c1: "C3",
    to: "=",
    c2: "C18",
    m: "A"
}, {
    c1: "C4",
    to: "=",
    c2: "C18",
    m: "A"
}, {
    c1: "C5",
    to: "=",
    c2: "C19",
    m: "A"
}, {
    c1: "C5",
    to: "=",
    c2: "C20",
    m: "A"
}, {
    c1: "C6",
    to: "=",
    c2: "C21",
    m: "A"
}, {
    c1: "C7",
    to: "=",
    c2: "C22",
    m: "A"
}, {
    c1: "C9",
    to: "=",
    c2: "C23",
    m: "A"
}, {
    c1: "C9",
    to: "=",
    c2: "C24",
    m: "A"
}, {
    c1: "C9",
    to: "=",
    c2: "C25",
    m: "A"
}, {
    c1: "C11",
    to: "=",
    c2: "C24",
    m: "A"
}, {
    c1: "C26",
    to: "=",
    c2: "C24",
    m: "A"
}, {
    c1: "C26",
    to: "=",
    c2: "C25",
    m: "A"
}, {
    c1: "C27",
    to: "=",
    c2: "C10",
    m: "A"
}, {
    c1: "C8",
    to: "=",
    c2: "C28",
    m: "A"
}, {
    c1: "C12",
    to: "=",
    c2: "C29",
    m: "A"
}, {
    c1: "C57",
    to: "=",
    c2: "C43",
    m: "A"
}, {
    c1: "C58",
    to: "=",
    c2: "C43",
    m: "A"
}];
var CPList = [{
    c: "C0",
    to: "=",
    p: "P0",
    m: "A"
}, {
    c: "C0",
    to: "=",
    p: "P2",
    m: "A"
}, {
    c: "C2",
    to: "=",
    p: "P4",
    m: "A"
}, {
    c: "C2",
    to: "=",
    p: "P5",
    m: "A"
}, {
    c: "C3",
    to: "=",
    p: "P11",
    m: "A"
}, {
    c: "C4",
    to: "=",
    p: "P12",
    m: "A"
}, {
    c: "C5",
    to: "=",
    p: "P16",
    m: "A"
}, {
    c: "C6",
    to: "=",
    p: "P16",
    m: "A"
}, {
    c: "C6",
    to: "=",
    p: "P28",
    m: "A"
}, {
    c: "C7",
    to: "=",
    p: "P28",
    m: "A"
}, {
    c: "C7",
    to: "=",
    p: "P27",
    m: "A"
}, {
    c: "C7",
    to: "=",
    p: "P24",
    m: "A"
}, {
    c: "C7",
    to: "=",
    p: "P25",
    m: "A"
}, {
    c: "C8",
    to: "=",
    p: "P6",
    m: "A"
}, {
    c: "C9",
    to: "=",
    p: "P17",
    m: "A"
}, {
    c: "C10",
    to: "=",
    p: "P17",
    m: "A"
}, {
    c: "C10",
    to: "=",
    p: "P23",
    m: "A"
}, {
    c: "C11",
    to: "=",
    p: "P23",
    m: "A"
}, {
    c: "C11",
    to: "=",
    p: "P19",
    m: "A"
}, {
    c: "C12",
    to: "=",
    p: "P17",
    m: "A"
}, {
    c: "C30",
    to: "=",
    p: "P1",
    m: "A"
}, {
    c: "C31",
    to: "=",
    p: "P1",
    m: "A"
}, {
    c: "C13",
    to: "=",
    p: "P0",
    m: "A"
}, {
    c: "C32",
    to: "=",
    p: "P0",
    m: "A"
}, {
    c: "C33",
    to: "=",
    p: "P0",
    m: "A"
}, {
    c: "C30",
    to: "=",
    p: "P2",
    m: "A"
}, {
    c: "C33",
    to: "=",
    p: "P2",
    m: "A"
}, {
    c: "C32",
    to: "=",
    p: "P3",
    m: "A"
}, {
    c: "C34",
    to: "=",
    p: "P3",
    m: "A"
}, {
    c: "C15",
    to: "=",
    p: "P4",
    m: "A"
}, {
    c: "C16",
    to: "=",
    p: "P4",
    m: "A"
}, {
    c: "C17",
    to: "=",
    p: "P4",
    m: "A"
}, {
    c: "C35",
    to: "=",
    p: "P4",
    m: "A"
}, {
    c: "C14",
    to: "=",
    p: "P5",
    m: "A"
}, {
    c: "C15",
    to: "=",
    p: "P5",
    m: "A"
}, {
    c: "C16",
    to: "=",
    p: "P5",
    m: "A"
}, {
    c: "C17",
    to: "=",
    p: "P5",
    m: "A"
}, {
    c: "C35",
    to: "=",
    p: "P5",
    m: "A"
}, {
    c: "C32",
    to: "=",
    p: "P6",
    m: "A"
}, {
    c: "C36",
    to: "=",
    p: "P6",
    m: "A"
}, {
    c: "C36",
    to: "=",
    p: "P7",
    m: "A"
}, {
    c: "C37",
    to: "=",
    p: "P7",
    m: "A"
}, {
    c: "C38",
    to: "=",
    p: "P7",
    m: "A"
}, {
    c: "C39",
    to: "=",
    p: "P9",
    m: "A"
}, {
    c: "C40",
    to: "=",
    p: "P9",
    m: "A"
}, {
    c: "C37",
    to: "=",
    p: "P10",
    m: "A"
}, {
    c: "C41",
    to: "=",
    p: "P10",
    m: "A"
}, {
    c: "C42",
    to: "=",
    p: "P8",
    m: "A"
}, {
    c: "C42",
    to: "=",
    p: "P20",
    m: "A"
}, {
    c: "C43",
    to: "=",
    p: "P20",
    m: "A"
}, {
    c: "C43",
    to: "=",
    p: "P21",
    m: "A"
}, {
    c: "C44",
    to: "=",
    p: "P20",
    m: "A"
}, {
    c: "C45",
    to: "=",
    p: "P20",
    m: "A"
}, {
    c: "C44",
    to: "=",
    p: "P24",
    m: "A"
}, {
    c: "C46",
    to: "=",
    p: "P25",
    m: "A"
}, {
    c: "C47",
    to: "=",
    p: "P25",
    m: "A"
}, {
    c: "C48",
    to: "=",
    p: "P26",
    m: "A"
}, {
    c: "C49",
    to: "=",
    p: "P26",
    m: "A"
}, {
    c: "C19",
    to: "=",
    p: "P26",
    m: "A"
}, {
    c: "C19",
    to: "=",
    p: "P16",
    m: "A"
}, {
    c: "C20",
    to: "=",
    p: "P16",
    m: "A"
}, {
    c: "C21",
    to: "=",
    p: "P16",
    m: "A"
}, {
    c: "C22",
    to: "=",
    p: "P28",
    m: "A"
}, {
    c: "C22",
    to: "=",
    p: "P27",
    m: "A"
}, {
    c: "C48",
    to: "=",
    p: "P19",
    m: "A"
}, {
    c: "C49",
    to: "=",
    p: "P19",
    m: "A"
}, {
    c: "C50",
    to: "=",
    p: "P17",
    m: "A"
}, {
    c: "C51",
    to: "=",
    p: "P17",
    m: "A"
}, {
    c: "C52",
    to: "=",
    p: "P13",
    m: "A"
}, {
    c: "C53",
    to: "=",
    p: "P14",
    m: "A"
}, {
    c: "C37",
    to: "=",
    p: "P18",
    m: "A"
}, {
    c: "C54",
    to: "=",
    p: "P18",
    m: "A"
}, {
    c: "C55",
    to: "=",
    p: "P18",
    m: "A"
}, {
    c: "C28",
    to: "=",
    p: "P15",
    m: "A"
}, {
    c: "C31",
    to: "=",
    p: "P15",
    m: "A"
}, {
    c: "C56",
    to: "=",
    p: "P15",
    m: "A"
}, {
    c: "C57",
    to: "=",
    p: "P14",
    m: "A"
}, {
    c: "C57",
    to: "=",
    p: "P20",
    m: "A"
}, {
    c: "C57",
    to: "=",
    p: "P21",
    m: "A"
}, {
    c: "C57",
    to: "=",
    p: "P22",
    m: "A"
}, {
    c: "C58",
    to: "=",
    p: "P21",
    m: "A"
}];



var PPList = [{
    p1: "P16",
    to: ">",
    p2: "P28",
    m: "B"
}, {
    p1: "P24",
    to: ">",
    p2: "P25",
    m: "B"
}, {
    p1: "P24",
    to: ">",
    p2: "P27",
    m: "B"
}, {
    p1: "P24",
    to: ">",
    p2: "P28",
    m: "B"
}, {
    p1: "P25",
    to: ">",
    p2: "P27",
    m: "B"
}, {
    p1: "P25",
    to: ">",
    p2: "P28",
    m: "B"
}, {
    p1: "P28",
    to: ">",
    p2: "P27",
    m: "B"
}, {
    p1: "P23",
    to: ">",
    p2: "P17",
    m: "B"
}, {
    p1: "P23",
    to: ">",
    p2: "P19",
    m: "B"
}, {
    p1: "P0",
    to: ">",
    p2: "P2",
    m: "B"
}, {
    p1: "P4",
    to: ">",
    p2: "P5",
    m: "B"
}, {
    p1: "P21",
    to: "=",
    p2: "P26",
    m: "A"
}, {
    p1: "P21",
    to: "=",
    p2: "P24",
    m: "A"
}, {
    p1: "P21",
    to: "=",
    p2: "P20",
    m: "A"
}, {
    p1: "P21",
    to: "=",
    p2: "P22",
    m: "A"
}, {
    p1: "P20",
    to: "=",
    p2: "P22",
    m: "A"
}, {
    p1: "P21",
    to: "=",
    p2: "P24",
    m: "A"
}, {
    p1: "P21",
    to: "=",
    p2: "P25",
    m: "A"
}, {
    p1: "P24",
    to: "=",
    p2: "P25",
    m: "A"
}, {
    p1: "P26",
    to: "=",
    p2: "P16",
    m: "A"
}, {
    p1: "P21",
    to: "=",
    p2: "P8",
    m: "A"
}, {
    p1: "P11",
    to: "=",
    p2: "P12",
    m: "A"
}, {
    p1: "P14",
    to: ">",
    p2: "P20",
    m: "B"
}, {
    p1: "P14",
    to: ">",
    p2: "P21",
    m: "B"
}, {
    p1: "P14",
    to: ">",
    p2: "P22",
    m: "B"
}];
var PS = ["P1", "P15", "P0", "P2", "P3", "P4", "P5", "P6", "P9",
    "P7", "P10", "P18", "P11", "P12", "P14", "P8", "P20", "P22", "P21", "P24", "P25", "P26", "P16",
    "P28", "P27", "P23", "P19", "P17",
    "P13"
];

var CS = ["C30", "C31", "C56", "C32", "C33", "C34", "C35", "C36",
    "C38", "C39", "C40", "C41",

    "C37", "C54", "C55",
    "C14", "C15", "C16", "C18", "C17", "C13", "C28",
    "TOP_SPACE", "C0", "C1", "C2", "C8",
    "C3", "C4", "C57", "C58", "C10", "C7",
    "C9", "C26", "C5", "C6", "C11", "C12", "TOP_SPACE",
    "C43", "C27", "C22", "C23", "C24", "C25",
    "C19",
    "C20", "C21", "C29", "C42", "C44", "C45", "C46", "C47", "C48", "C49",
    "C50", "C51", "C52", "C53"
];
var BGColor = "#252525";
var PPMColor = [{
        "m": "A",
        "name": "直系亲属",
        "color": "#fc3c3c"
    }, {
        "m": "B",
        "name": "股东",
        "color": "#a43dcc"
    }
    /*, {
    	"m" : "C",
    	"name" : "师徒",
    	"color" : "#f1882d"
    }*/
];
var CPColor = "#4d4d4d";
var WeakenColor = "#666";
var CCMColor = [{
    "m": "A",
    "name": "投资",
    "color": "#ffff99"
}, {
    "m": "B",
    "name": "持股",
    "color": "#D0D0D0"
}, {
    "m": "C",
    "name": "",
    "color": "#6856de"
}];
var CMColor = [{
    "m": "B",
    "name": "莆田系医院",
    "color": "#93bbd5"
}, {
    "m": "A",
    "name": "相关企业",
    "color": "#cbcacc"
}, {
    "m": "C",
    "name": "",
    "color": "#45a4cc"
}, {
    "m": "D",
    "name": "",
    "color": "#45a4cc"
}];
document
    .write("<div style='background-color:" +
        BGColor +
        ";width:100%;'><div id='firstDiv'><canvas id='firstCanvas'></canvas></div></div>");
var WIDTH = 1240;
var HEIGHT = 750;
var time = 0;
var mouseX = 0;
var mouseY = 0;
var stagePressed = true;
var clickObject = null;
var startText = "【财新网 caixin.com】/";
$(document)
    .ready(
        function() {
            $("#firstDiv").css({
                "width": "100%"
            });
            $("#firstCanvas").attr("width", WIDTH);
            $("#firstCanvas").attr("height", HEIGHT);
            $("#firstCanvas").css({
                "display": "block",
                "margin-left": "auto",
                "margin-right": "auto",
                "background-color": BGColor
            });
            var canvas = document.getElementById("firstCanvas");
            var main = canvas.getContext("2d");
            canvas.addEventListener("mousemove", mousemove, false);
            canvas.addEventListener("mousedown", mousedown, false);

            function mousemove(e) {
                mouseX = e.clientX + $(window).scrollLeft() -
                    $(canvas).offset().left;
                mouseY = e.clientY + $(window).scrollTop() -
                    $(canvas).offset().top
            }

            function mousedown(e) {
                if (caixin.checkMouse()) {
                    caixin.click()
                }
                for (var i = 0; i < PArray.length; i++) {
                    if (PArray[i].checkMouse()) {
                        PArray[i].click();
                        stagePressed = false;
                        return
                    }
                }
                for (var i = 0; i < CArray.length; i++) {
                    if (CArray[i].checkMouse()) {
                        CArray[i].click();
                        stagePressed = false;
                        return
                    }
                }
                stagePressed = true;
                clickObject = null
            }
            var hasPhoto = false;
            var photo = new Image();
            photo.src = "";
            photo.onload = function() {
                hasPhoto = true
            };
            photo.onerror = function() {
                hasPhoto = false
            };
            var INFO = function() {
                this.x = 930;
                this.y = 30;
                this.name = "";
                this.text = "";
                this.offsetX = 90;
                this.offsetY = 0;
                this.minWidth = 190;
                this.maxWidth = this.minWidth + this.offsetX;
                this.top = 40;
                this.bottom = 230;
                this.startY = 0;
                this.h = 0
            };
            INFO.prototype.display = function() {
                main.globalAlpha = 1;
                main.fillStyle = "#fff";
                main.font = "13px 'Microsoft YaHei', 微软雅黑";
                if (hasPhoto) {
                    this.h = multiLineText(this.text, this.x +
                        this.offsetX, this.y + 60 + this.offsetY +
                        this.startY, this.minWidth)
                } else {
                    this.h = multiLineText(this.text, this.x, this.y +
                        60 + this.offsetY + this.startY,
                        this.maxWidth)
                }
                main.fillStyle = BGColor;
                main.fillRect(this.x, 0, this.maxWidth + 30, this.y +
                    this.top);
                main.fillRect(this.x, this.y + this.bottom,
                    this.maxWidth + 30, 800);
                if (this.h > this.bottom - this.top) {
                    this.startY = (this.bottom - this.top) * .5;
                    main.strokeStyle = "#444";
                    main.lineWidth = 1;
                    main.beginPath();
                    main.moveTo(this.x + this.offsetX, this.y + 30);
                    if (hasPhoto) {
                        main.lineTo(this.x + this.offsetX +
                            this.minWidth, this.y + 30)
                    } else {
                        main.lineTo(this.x + this.offsetX +
                            this.maxWidth, this.y + 30)
                    }
                    main.stroke();
                    main.strokeStyle = "#88c7e2";
                    main.lineWidth = 1;
                    main.beginPath();
                    main.moveTo(this.x + this.offsetX, this.y + 30);
                    if (hasPhoto) {
                        main
                            .lineTo(
                                this.x +
                                this.offsetX +
                                Math
                                .min(
                                    this.minWidth *
                                    -this.offsetY /
                                    (this.h -
                                        (this.bottom - this.top) + this.startY),
                                    this.minWidth),
                                this.y + 30)
                    } else {
                        main
                            .lineTo(
                                this.x +
                                this.offsetX +
                                Math
                                .min(
                                    this.maxWidth *
                                    -this.offsetY /
                                    (this.h -
                                        (this.bottom - this.top) + this.startY),
                                    this.maxWidth),
                                this.y + 30)
                    }
                    main.stroke();
                    this.offsetY -= .8;
                    if (this.offsetY + this.startY <= -this.h) {
                        this.offsetY = 0;
                        this.count = 0
                    }
                } else {
                    this.startY = 0
                }
                main.fillStyle = "#fff";
                main.font = "16px 'Microsoft YaHei', 微软雅黑";
                main.fillText(this.name, this.x + this.offsetX,
                    this.y + 20);
                if (hasPhoto) {
                    main.drawImage(photo, this.x, this.y, 80, 80);
                    this.offsetX = 90
                } else {
                    this.offsetX = 0
                }
            };

            var Caixin = function() {
                this.x;
                this.y
            };
            Caixin.prototype.checkMouse = function() {
                return mouseX > this.x && mouseX < this.x + 100 &&
                    mouseY > this.y && mouseY < this.y + 100
            };
            var caixin = new Caixin();
            var LogoAndLegend = function() {
                this.logoX = 10;
                this.PPMLegendX = 20;
                this.CCMLegendX = 250;
                this.CMLegendX = 450;
                this.LegendY = 710;
                this.y = 20;
            };
            LogoAndLegend.prototype.display = function() {
                PPMLegend(this.PPMLegendX, this.y + this.LegendY, 40);
                CCMLegend(this.CCMLegendX, this.y + this.LegendY, 40);
                CMLegend(this.CMLegendX, this.y + this.LegendY, 40);
            };
            var G = function(name) {
                this.name = name;
                this.alpha = 1;
                this.weaken = false
            };
            G.prototype.display = function() {
                if (this.weaken) {
                    this.alpha = .5
                } else {
                    this.alpha = 1
                }
                main.fillStyle = "#c7b299";
                main.globalAlpha = this.alpha;
                main.font = "14px 'Microsoft YaHei', 微软雅黑";
                verticalText(this.name, this.x, this.y + 8, 16)
            };
            var P = function(id, name, photo, information) {
                this.id = id;
                this.name = name;
                this.photo = photo;
                this.information = startText + information;
                this.init()
            };
            P.prototype.init = function() {
                this.over = false;
                this.font = "14px 'Microsoft YaHei', 微软雅黑";
                this.lineHeight = 16;
                this.alpha = 1;
                this.color = "#fff";
                this.weaken = false
            };
            P.prototype.display = function() {
                if (this.weaken) {
                    this.color = WeakenColor
                } else {
                    this.color = "#fff"
                }
                main.globalAlpha = this.alpha;
                main.fillStyle = this.color;
                main.font = this.font;
                verticalText(this.name, this.x, this.y + 8,
                    this.lineHeight);
                if (this.number) {
                    this.subscript(this.number)
                }
            };
            P.prototype.subscript = function(number) {
                main.fillStyle = "#fff";
                main.beginPath();
                main.arc(this.x, this.y + 72, 7, 0, 2 * Math.PI);
                main.fill();
                main.font = "12px 'Microsoft YaHei', 微软雅黑";
                main.fillStyle = "#000";
                main.fillText(number, this.x - 3, this.y + 76)
            };
            P.prototype.checkMouse = function() {
                return mouseX > this.x - 12 && mouseX < this.x + 12 &&
                    mouseY > this.y && mouseY < this.y + 100
            };
            P.prototype.checkMouseEvent = function() {
                if (this.checkMouse()) {
                    if (!this.over) {
                        this.over = true;
                        this.mosueOver()
                    }
                    this.weaken = false
                } else {
                    if (this.over) {
                        this.over = false;
                        this.mosueOut()
                    }
                }
            };
            P.prototype.mosueOver = function() {
                this.font = "15px 'Microsoft YaHei', 微软雅黑";
                this.lineHeight = 18;
                if (this.photo != "") {
                    photo.src = "http://file.caixin.com/datanews/zhou/img/photo/" +
                        this.photo
                } else {
                    hasPhoto = false
                }
                info.name = this.name;
                info.text = this.information;
                info.y = 40;
                info.offsetY = 0
            };
            P.prototype.mosueOut = function() {
                this.font = "14px 'Microsoft YaHei', 微软雅黑";
                this.lineHeight = 16
            };
            P.prototype.click = function() {
                clickObject = this
            };
            P.prototype.connectChildren = function() {
                for (var i = 0; i < PPArray.length; i++) {
                    if (PPArray[i].p1.id == this.id) {
                        PPArray[i].display();
                        PPArray[i].p1.weaken = false;
                        PPArray[i].p2.weaken = false;
                    }
                }
            };
            P.prototype.connectParent = function() {
                for (var i = 0; i < PPArray.length; i++) {
                    if (PPArray[i].p2.id == this.id) {
                        PPArray[i].display();
                        PPArray[i].p1.weaken = false;
                        PPArray[i].p1.connectParent()
                    }
                }
            };
            var C = function(id, name, m, information) {
                this.id = id;
                this.name = name;
                this.m = m;
                this.information = startText + information;
                this.init()
            };
            C.prototype.init = function() {
                this.over = false;
                this.font = "12px 'Microsoft YaHei', 微软雅黑";
                this.lineHeight = 16;
                this.color = getColorByCM(this.m);
                this.alpha = 1;
                this.weaken = false
            };
            C.prototype.display = function() {
                if (this.weaken) {
                    this.color = WeakenColor
                } else {
                    this.color = getColorByCM(this.m)
                }
                main.globalAlpha = this.alpha;
                main.fillStyle = this.color;
                main.font = this.font;
                verticalText(this.name, this.x, this.y + 8,
                    this.lineHeight)
            };
            C.prototype.checkMouse = function() {
                return mouseX > this.x - 10 && mouseX < this.x + 10 &&
                    mouseY > this.y && mouseY < this.y + 200
            };
            C.prototype.checkMouseEvent = function() {
                if (this.checkMouse()) {
                    if (!this.over) {
                        this.over = true;
                        this.mosueOver()
                    }
                    this.weaken = false;
                    this.color = getColorByCM(this.m)
                } else {
                    if (this.over) {
                        this.over = false;
                        this.mosueOut()
                    }
                }
            };
            C.prototype.mosueOver = function() {
                this.font = "13px 'Microsoft YaHei', 微软雅黑";
                this.lineHeight = 18;
                hasPhoto = false;
                if (this.information != "") {
                    if (this.name.charAt(0) == "/") {
                        info.name = this.name.slice(1)
                    } else {
                        info.name = this.name
                    }
                    info.text = this.information;
                    console.log(document.documentElement.clientHeight);
                    if (document.documentElement.clientHeight < 600) {
                        info.y = 190
                    } else {
                        info.y = 40
                    }
                } else {
                    info.name = "";
                    info.text = ""
                }
                info.offsetY = 0
            };
            C.prototype.mosueOut = function() {
                this.font = "12px 'Microsoft YaHei', 微软雅黑";
                this.lineHeight = 16
            };
            C.prototype.click = function() {
                clickObject = this
            };
            C.prototype.connectChildren = function() {
                this.weaken = false;
                for (var i = 0; i < CCArray.length; i++) {
                    if (CCArray[i].c1.id == this.id) {
                        CCArray[i].display();
                        var c2 = getCByID(CCList[i].c2);
                        c2.connectChildren();
                    }
                }
            };
            C.prototype.connectParent = function() {
                this.weaken = false;
                for (var i = 0; i < CCArray.length; i++) {
                    if (CCArray[i].c2.id == this.id) {
                        CCArray[i].display();
                        var c1 = getCByID(CCList[i].c1);
                        c1.connectParent();
                        c1.connectP();
                    }
                }
            };
            C.prototype.connectP = function() {
                this.weaken = false;
                for (var i = 0; i < CPArray.length; i++) {
                    if (CPArray[i].c.id == this.id) {
                        CPArray[i].display();
                        CPArray[i].p.weaken = false;
                        CPArray[i].c.weaken = false;
                        CPArray[i].p.connectParent();
                    }
                }
            };
            var PP = function(p1, to, p2, m) {
                this.p1 = p1;
                this.to = to;
                this.p2 = p2;
                this.m = m;
                this.init()
            };
            PP.prototype.init = function() {
                this.x = (this.p1.x + this.p2.x) * .5;
                this.y = this.p1.y;
                this.r = Math.abs(this.p1.x - this.p2.x) * .5;
                this.color = getColorByPPM(this.m);
                this.xpath = new Array();
                this.ypath = new Array();
                this.pointList = [];
                this.n = 200;
                for (var i = 0; i < this.n; i++) {
                    if (this.p2.x - this.p1.x > 0) {
                        this.xpath[i] = this.x +
                            Math.cos(-i % this.n / this.n *
                                Math.PI) * this.r;
                        this.ypath[i] = this.y +
                            Math.sin(-i % this.n / this.n *
                                Math.PI) * this.r;
                        this.pointList.push(this.xpath[i], this.ypath[i]);
                    } else {
                        this.xpath[i] = this.x +
                            Math.cos(-Math.PI + i % this.n /
                                this.n * Math.PI) * this.r;
                        this.ypath[i] = this.y +
                            Math.sin(-Math.PI + i % this.n /
                                this.n * Math.PI) * this.r;
                        this.pointList.push(this.xpath[i], this.ypath[i]);
                    }
                }
            };
            PP.prototype.display = function() {


                main.globalAlpha = 1;
                main.strokeStyle = this.color;
                main.beginPath();
                main.arc(this.x, this.y, this.r, Math.PI, 0);
                main.stroke();
                if (this.to == ">") {
                    var t = time % this.n;
                    //main.fillStyle = "#fff";
                    main.fillStyle = 'rgba(255,255,255,.9)';

                    main.beginPath();
                    main.arc(this.xpath[t], this.ypath[t], 2.5, 0,
                        Math.PI * 2, true);
                    main.fill();
                }
            };




            var CC = function(c1, to, c2, m) {
                this.c1 = c1;
                this.to = to;
                this.c2 = c2;
                this.m = m;
                this.init()
            };
            CC.prototype.init = function() {
                this.x = (this.c1.x + this.c2.x) * .5;
                this.y = this.c1.y;
                this.r = Math.abs(this.c1.x - this.c2.x) * .5;
                this.color = getColorByCCM(this.m);
                this.xpath = new Array();
                this.ypath = new Array();
                this.n = 200;
                for (var i = 0; i < this.n; i++) {
                    if (this.c2.x - this.c1.x > 0) {
                        this.xpath[i] = this.x +
                            Math.cos(-i % this.n / this.n *
                                Math.PI) * this.r;
                        this.ypath[i] = this.y +
                            Math.sin(-i % this.n / this.n *
                                Math.PI) * this.r
                    } else {
                        this.xpath[i] = this.x +
                            Math.cos(-Math.PI + i % this.n /
                                this.n * Math.PI) * this.r;
                        this.ypath[i] = this.y +
                            Math.sin(-Math.PI + i % this.n /
                                this.n * Math.PI) * this.r
                    }
                }
            };
            CC.prototype.display = function() {
                main.globalAlpha = 1;
                main.strokeStyle = this.color;

                /*if(this.m == "C"){
                	this.c2.type = "arc";
                }else if(this.c2.m == "B"){
                	this.c2.type = "line";
                }*/
                if (this.c2.type == "arc") {
                    main.beginPath();
                    main.arc(this.x, this.y, this.r, Math.PI, 0);
                    main.stroke();
                    if (this.to == ">") {
                        var t = time % this.n;
                        main.fillStyle = "#fff";
                        main.beginPath();
                        main.arc(this.xpath[t], this.ypath[t], 2.5,
                            Math.PI * 2, 0);
                        main.fill()
                    }
                } else {
                    main.globalAlpha = .5;
                    main.strokeStyle = this.color;
                    main.beginPath();
                    main.moveTo(this.c1.x, this.c1.y + 210);
                    main.lineTo(this.c2.x, this.c2.y);
                    main.stroke();
                    if (this.c1.y + this.c1.name.length * 18 + 10 < this.c1.y + 210) {
                        main.beginPath();
                        main.moveTo(this.c1.x, this.c1.y +
                            this.c1.name.length * 18 + 10);
                        main.lineTo(this.c1.x, this.c1.y + 180);
                        main.stroke()
                    }
                }
            };
            var CP = function(c, to, p, m) {
                this.c = c;
                this.to = to;
                this.p = p;
                this.m = m;
                this.color = getColorByCCM(this.m)
            };
            CP.prototype.display = function() {
                if (clickObject != null) {
                    main.globalAlpha = .5;
                    main.strokeStyle = this.color
                } else {
                    main.globalAlpha = 1;
                    main.strokeStyle = CPColor
                }
                main.beginPath();
                main.moveTo(this.p.x, this.p.y + 72);
                main.lineTo(this.c.x, this.c.y);
                main.stroke()
            };
            var GArray = new Array();
            var PArray = new Array();
            var CArray = new Array();
            var PPArray = new Array();
            var CPArray = new Array();
            var CCArray = new Array();
            var logoAndLegend = new LogoAndLegend();
            var info = new INFO();
            for (var i = 0; i < PS.length; i++) {
                var space = 20;
                var x = 20;
                var y = 100;
                if (PS[i] != "") {
                    if (PS[i].charAt(0) == "G") {
                        var g = new G(PS[i].slice(1));
                        g.x = x + i * space;
                        g.y = y;
                        GArray.push(g)
                    } else {
                        var pData = getPDataByID(PS[i]);
                        var p = new P(pData.id, pData.name,
                            pData.photo, pData.information);
                        p.x = x + 280 + i * 1.1 * space;
                        p.y = y;
                        PArray.push(p)
                    }
                }
            }
            var space = 20;
            var x1 = 0;
            var x2 = 0;
            var y = 400;
            for (var i = 0; i < CS.length; i++) {
                if (CS[i] != "TOP_SPACE" && CS[i] != "BOTTOM_SPACE") {
                    var cData = getCDataByID(CS[i]);
                    var c = new C(cData.id, cData.name, cData.m,
                        cData.information);
                    if (cData.m == "") {
                        c.type = "line";
                        x2 += space;
                        c.x = x2;
                        c.y = y + 350;
                    } else {
                        c.type = "arc";
                        x1 += space;
                        c.x = x1;
                        c.y = y;
                    }
                    CArray.push(c);
                } else {
                    if (CS[i] == "TOP_SPACE") {
                        x1 += space;
                    } else {
                        x2 += space;
                    }
                }
            }

            function CtoPs(c) {
                for (var i = 0; i < CPList.length; i++) {
                    if (CPList[i].c == c) {
                        return true
                    }
                }
                return false
            }

            function CtoCs(c) {
                for (var i = 0; i < CCList.length; i++) {
                    if (CCList[i].c1 == c) {
                        return true
                    }
                }
                return false
            }
            for (var i = 0; i < PPList.length; i++) {
                var p1 = getPByID(PPList[i].p1);
                var p2 = getPByID(PPList[i].p2);
                var pp = new PP(p1, PPList[i].to, p2, PPList[i].m);
                PPArray.push(pp)
            }
            for (var i = 0; i < CPList.length; i++) {
                var c = getCByID(CPList[i].c);
                var p = getPByID(CPList[i].p);
                var cp = new CP(c, CPList[i].to, p, CPList[i].m);
                CPArray.push(cp)
            }
            for (var i = 0; i < CCList.length; i++) {
                var c1 = getCByID(CCList[i].c1);
                var c2 = getCByID(CCList[i].c2);
                var cc = new CC(c1, CCList[i].to, c2, CCList[i].m);
                CCArray.push(cc)
            }
            window.requestAnimFrame = (function() {
                return window.requestAnimationFrame ||
                    window.webkitRequestAnimationFrame ||
                    window.mozRequestAnimationFrame ||
                    window.oRequestAnimationFrame ||
                    window.msRequestAnimationFrame ||

                    function(callback) {
                        window.setTimeout(callback, 1000 / 33)
                    }
            })();
            (function draw() {
                requestAnimFrame(draw);
                main.clearRect(0, 0, canvas.width, canvas.height);
                main.lineWidth = 1;
                //info.display();
                logoAndLegend.display();
                for (var i = 0; i < GArray.length; i++) {
                    if (clickObject == null) {
                        GArray[i].weaken = false
                    } else {
                        GArray[i].weaken = true
                    }
                    GArray[i].display()
                }
                for (var i = 0; i < PArray.length; i++) {
                    if (clickObject == null || clickObject == PArray[i]) {
                        PArray[i].weaken = false
                    } else {
                        PArray[i].weaken = true
                    }
                    PArray[i].checkMouseEvent()
                }
                for (var i = 0; i < CArray.length; i++) {
                    if (clickObject == null || clickObject == CArray[i]) {
                        CArray[i].weaken = false
                    } else {
                        CArray[i].weaken = true
                    }
                    CArray[i].checkMouseEvent()
                }
                for (var i = 0; i < PPArray.length; i++) {
                    if (clickObject == null ||
                        PPArray[i].p1.id == clickObject.id ||
                        PPArray[i].p2.id == clickObject.id) {
                        PPArray[i].display();
                        PPArray[i].p1.weaken = false;
                        PPArray[i].p2.weaken = false;
                        /*if (clickObject != null
								&& PPArray[i].p1.id == clickObject.id) {
							PPArray[i].p1.connectParent()
						}
						if (clickObject != null
								&& PPArray[i].p2.id == clickObject.id) {
							PPArray[i].p2.connectParent()
						}*/
                    }
                }
                for (var i = 0; i < CPArray.length; i++) {
                    if (clickObject == null ||
                        CPArray[i].p.id == clickObject.id ||
                        CPArray[i].c.id == clickObject.id) {
                        CPArray[i].display();
                        CPArray[i].p.weaken = false;
                        CPArray[i].c.weaken = false;
                        if (clickObject != null &&
                            CPArray[i].p.id == clickObject.id) {
                            CPArray[i].c.connectChildren();
                            CPArray[i].c.connectParent();
                        }
                        if (clickObject != null &&
                            CPArray[i].c.id == clickObject.id) {
                            CPArray[i].p.connectParent();
                            CPArray[i].p.connectChildren();
                        }
                    }
                }
                for (var i = 0; i < CCArray.length; i++) {
                    if (clickObject == null ||
                        CCArray[i].c1.id == clickObject.id ||
                        CCArray[i].c2.id == clickObject.id) {
                        CCArray[i].c1.weaken = false;
                        CCArray[i].display();
                        if (clickObject != null &&
                            CCArray[i].c1.id == clickObject.id) {
                            var c1 = getCByID(CCList[i].c1);
                            c1.connectChildren()
                        }
                        if (clickObject != null &&
                            CCArray[i].c2.id == clickObject.id) {
                            var c2 = getCByID(CCList[i].c2);
                            c2.connectParent();
                            c2.connectChildren()
                        }
                    }
                }
                for (var i = 0; i < PArray.length; i++) {
                    PArray[i].display()
                }
                for (var i = 0; i < CArray.length; i++) {
                    CArray[i].display()
                }
                time++
            })();

            function getPDataByID(id) {
                for (var i = 0; i < PList.length; i++) {
                    if (PList[i].id == id) {
                        return PList[i]
                    }
                }
            }

            function getPByID(id) {
                for (var i = 0; i < PArray.length; i++) {
                    if (PArray[i].id == id) {
                        return PArray[i]
                    }
                }
            }

            function getCDataByID(id) {
                for (var i = 0; i < CList.length; i++) {
                    if (CList[i].id == id) {
                        return CList[i]
                    }
                }
            }

            function getCByID(id) {
                for (var i = 0; i < CArray.length; i++) {
                    if (CArray[i].id == id) {
                        return CArray[i]
                    }
                }
            }

            function verticalText(string, x, y, h) {
                var vertical = true;
                main.save();
                main.translate(x, y);
                for (var i = 0; i < string.length; i++) {
                    if (string.charCodeAt(i) > 255) {
                        main.translate(0, h);
                        main
                            .fillText(string.charAt(i), -main.measureText(string
                                    .charAt(i)).width / 2,
                                0)
                    } else {
                        main.save();
                        main.translate(-5, 6);
                        main.rotate(Math.PI / 2);
                        main.fillText(string.charAt(i), 0, 0);
                        main.restore();
                        main.translate(0, main.measureText(string
                            .charAt(i)).width + 2)
                    }
                }
                main.restore()
            }

            function multiLineText(string, x, y, w) {
                var tx = 28;
                var ty = 0;
                for (var i = 0; i < string.length; i++) {
                    var c = string.charAt(i);
                    if (c != "/") {
                        main.fillText(c, x + tx, y + ty);
                        tx += main.measureText(c).width + 2;
                        if (tx > w) {
                            tx = 0;
                            ty += 20
                        }
                    } else {
                        tx = 28;
                        ty += 40
                    }
                }
                return ty + 20
            }

            function PPMLegend(x, y, space) {
                for (var i = 0; i < PPMColor.length; i++) {
                    main.globalAlpha = 1;
                    main.fillStyle = PPMColor[i].color;
                    main.fillRect(x - 8, y - 1, 16, 2);
                    if (PPMColor[i].m != "A") {
                        main.fillStyle = "#fff";
                        main.beginPath();
                        main.arc(x, y, 2.5, 0, Math.PI * 2);
                        main.fill()
                    }
                    main.fillStyle = "#ccc";
                    main.font = "12px 'Microsoft YaHei', 微软雅黑";
                    main.fillText(PPMColor[i].name, x + 14, y + 4);
                    x += main.measureText(PPMColor[i].name).width +
                        space
                }
            }

            function CCMLegend(x, y, space) {
                for (var i = 0; i < CCMColor.length; i++) {
                    if (CCMColor[i].name != "") {
                        main.globalAlpha = 1;
                        main.fillStyle = CCMColor[i].color;
                        main.fillRect(x - 8, y - 1, 16, 2);

                        if (CCMColor[i].m != "A") {
                            main.fillStyle = "#fff";
                            main.beginPath();
                            main.arc(x, y, 2.5, 0, Math.PI * 2);
                            main.fill()
                        }

                        /*main.fillStyle = "#fff";
                        main.beginPath();
                        main.arc(x, y, 2.5, 0, Math.PI * 2);
                        main.fill();*/
                        main.fillStyle = "#ccc";
                        main.font = "12px 'Microsoft YaHei', 微软雅黑";
                        main.fillText(CCMColor[i].name, x + 14, y + 4);
                        x += main.measureText(CCMColor[i].name).width +
                            space;
                    }

                }
            }

            function CMLegend(x, y, space) {
                for (var i = 0; i < 2; i++) {
                    main.globalAlpha = 1;
                    main.fillStyle = CMColor[i].color;
                    main.fillRect(x - 4, y - 4, 8, 8);
                    main.fillStyle = "#ccc";
                    main.font = "12px 'Microsoft YaHei', 微软雅黑";
                    main.fillText(CMColor[i].name, x + 14, y + 4);
                    x += main.measureText(CMColor[i].name).width +
                        space
                }
            }

            function getColorByPPM(m) {
                for (var i = 0; i < PPMColor.length; i++) {
                    if (PPMColor[i].m == m) {
                        return PPMColor[i].color
                    }
                }
            }

            function getColorByCCM(m) {
                for (var i = 0; i < CCMColor.length; i++) {
                    if (CCMColor[i].m == m) {
                        return CCMColor[i].color
                    }
                }
            }

            function getColorByCM(m) {
                for (var i = 0; i < CMColor.length; i++) {
                    if (CMColor[i].m == m) {
                        return CMColor[i].color
                    }
                }
            }
        });